{
    "doc": {
        "name": "wscreate",
        "type": "wscreate",
        "synopsis": "Defines the target page and template for new pages",
        "description": "<p>wscreate can be defined as part of a form to have new page(s) created on form submit.<\/p><p>wsedit is used to make a few changes to a page, so if you have a lot of changes you can also use wscreate. Just make sure all fields are within a form. As changeable fields or as hidden fields.<br><\/p>",
        "parameters": "<p><strong>mwtemplate <\/strong>= Name of the template<\/p><p><strong>mwwrite <\/strong>= Either the full name of the target page, or its prefix if used in combination with mwoption=\"add_random\" <br><\/p><p><strong>mwfollow<\/strong> = Will send the user to the newly created page. As off v.0.8.0.4.3 : mwfollow can have a value. The value will be a new url parameter on the mwreturn page with the title of the page created as value.<br><\/p><p>or<\/p><p><strong>mwwrite<\/strong> = Use fieldname values to build the title of the page. This has a security risk, but has been requested. Put names of the fields between square brackets. Also.. you can use [mwrandom] to have the random number inserted at a certain place in the title.<br><\/p><p><strong>mwoption <\/strong>= \"add_random\" for random numbers<\/p><p><strong>mwoption <\/strong>= \"next_available\" for the next available number. If mwwrite is : \"orders\/\", this option will find the highest order number (e.g. orders\/192) and will create a page with one number higher (e.g. orders\/193)<\/p><p><strong>mwoption <\/strong>= \"range:\" for the next available \r\nfree slot in a range of numbers. If mwwrite is : \"orders\/\", this option will find the first free spot in a range of numbers. If mwoption=\"range:2019000-2019999\" and mwwrite=\"orders\/\" then WSForm will start looking for a page called order\/2019000. If exists it will look for orders\/2019001&nbsp; etc.. till the first free page is found.<\/p><p><strong>mwleadingzero<\/strong> can be used in combination with range. When a range is set like 1-99999 using mwleadingzero will use the length of the&nbsp; end range and use it to fill the start range with leading zeros, making the range from 00001-99999.<br><\/p><p>or<\/p><p>mix of the above plus an extra field called&nbsp; : <strong>mwfields<\/strong>.<br><strong>mwfields<\/strong> = comma separated names of form elements that need to be included.<\/p><p>When <strong>mwfields<\/strong> is added to <strong>wscreate<\/strong>, multiple <strong>wscreate<\/strong> can be used.<\/p><br><p><strong>wsnone as a template name <\/strong>: When <strong>mwfields<\/strong> is used for only one form field and the value for <strong>mwtemplate<\/strong> is \"<strong><em>wsnone<\/em><\/strong>\", WSForm will create a page with a title created by mwwrite and only with the content of the mwfields form value.<br><\/p>",
        "example": "Used with a variable and mwfollow\r\n<wscreate mwwrite=\"{{#var:@targetpagetitle}}\" mwtemplate=\"Agency\" mwfollow \/>\r\n\r\nCreate a new page with the next available number\r\n<wscreate mwwrite=\"orders\/\" mwtemplate=\"Order\" mwoption=\"next_available\" \/>\r\n\r\nCreate a new page with the next available number in a range and always start from the beginning\r\n<wscreate mwwrite=\"orders\/\" mwtemplate=\"Order\" mwoption=\"range:2019000-2019999\" \/>\r\n\r\nPrefix + random number\r\n<wscreate mwwrite=\"Proj-solution:\" mwoption=\"add_random\" mwtemplate=\"Solution\" \/>\r\n\r\nCreate from text, mwrandom and fieldvalues\r\n<wscreate mwwrite=\"Proj-solution:[namefield]\/[mwrandom]\" mwtemplate=\"Solution\" \/>\r\n\r\nCreate from text and fieldvalues and only include specific form  element names in the new template\r\n<wscreate mwwrite=\"Proj-solution:[namefield]\/Personal\" mwtemplate=\"Personal\" mwfields=\"naam, adres, straat, plaats\" \/>\r\n<wscreate mwwrite=\"Proj-solution:[namefield]\/Business\" mwtemplate=\"Business\" mwfields=\"Company, cadres, cstraat, cplaats\" \/>\r\n\r\n",
        "note": "<p>If you create a page from text, mwrandom and fieldvalues and also add mwoption=\"add_random\", another random number will be added to the end of the page title.<em><br><br><strong>You can have multiple instances of wscreate in a form, as long as mwfields is an argument with every wscreate.<\/strong><\/em><\/p><p><span style=\"color: rgb(192, 80, 77);\">If you have multiple wscreate and they all have a mwfollow, the last wscreate in the list will be followed.<\/span><br><\/p>",
        "links": "...",
        "created": "",
        "created_by": "",
        "last modified": "26-03-2020 13:23:47",
        "modified by": "Charlot"
    }
}