{
    "doc": {
        "name": "errormessages",
        "type": "wsform",
        "synopsis": "list of (error) messages that might occur",
        "description": "<p>Here's a list of common error messages that might occur, with a brief description of what the problem might be.<br><\/p>",
        "parameters": "<table class=\"table\"><tbody><tr><td><strong>Message<\/strong><br><\/td><td><strong>Type<\/strong><\/td><td><strong>Why<\/strong><\/td><td><strong>Possible solutions<\/strong><br><\/td><\/tr><tr><td>Can not find template<\/td><td>wsemail<\/td><td>shown when the page mentioned in the template cannot be read or parse by the API<\/td><td><ul><li>check page name if it exists or not miss-spelled<\/li><li>check if WSForm has API rights to read or parse the page mentioned in the template variable<\/li><\/ul><\/td><\/tr><tr><td>not a secure form<\/td><td>wsform<\/td><td>shown when the sec option is set to true and the form has been manipulated after form submit<br><\/td><td><\/td><\/tr><tr><td>Secure fields not complete<\/td><td>wsform<\/td><td>shown when the sec option is set to true and files with type is secure (not to be manipulated with) are incomplete after a form submit<br><\/td><td><\/td><\/tr><tr><td>Did not receive a session token from the form.<\/td><td>wsform<\/td><td>shown when a secure token that is generated by WSForm did not come with a form submit<br><\/td><td><\/td><\/tr><tr><td>Form session expired<\/td><td>wsform<\/td><td>shown when the time between a form render and the actual submit has taken to long<br><\/td><td>Change the config option <strong>form-timeout-limit<\/strong> to a higher number in seconds ( default 7200 secs = 120 mins = 2 hours )<br><\/td><\/tr><tr><td>Form host and api host are not equal.<\/td><td>wsform<\/td><td>shown when the form has been submitted from a different host<br><\/td><td>This is security feature. However, sometimes in Cloud environments things can get complicated. Just make sure the one wiki does not post to an instance of another wiki<br><\/td><\/tr><tr><td>No return found<\/td><td>wsform<\/td><td>shown when a form has been submitted but wsform cannot find a page to return to after handling the form<br><\/td><td><\/td><\/tr><tr><td>no captcha details<\/td><td>reCaptcha<\/td><td>shown when a form with a recaptcha has been submitted, but no recaptcha information can be found in the form<br><\/td><td><\/td><\/tr><tr><td>No requests<\/td><td>wsform<\/td><td>shown when a form has been submitted, but WSForm could not find any valid request<br><\/td><td>Usually this means the <strong>action <\/strong>parameter of a form is invalid.<br><\/td><\/tr><\/tbody><\/table>",
        "example": "-",
        "note": "<p>-<br><\/p>",
        "links": "<p>-<br><\/p>",
        "created": "13-09-2021 11:35:01",
        "created_by": "Charlot",
        "last modified": "13-09-2021 22:09:53",
        "modified by": "Charlot"
    }
}